rails_auth_api/app/controllers/logins_controller.rb

  def create
    username = params[:username]
    password = params[:password]

    if username.blank? or password.blank?
      return render json: { message: '信息不全' }
    end

    if User.not_exists?(username: params[:username])
      return render json: { message: '用户不存在' }
    end
    user = User.find_by_username username;
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'root' LIMIT 1