rails_auth_api/app/controllers/users_controller.rb

  def create
    if params[:username].blank? or params[:password].blank?
      return render json: { message: '信息不全' }
    end
    @user = User.new user_params
    if User.exists?(username: @user.username)
      return render json: { message: "用户已经存在" }
    end

    @user.password_method(params[:password])

    if @user.save
---
SELECT 1 AS one FROM `users` WHERE `users`.`username` = '1' LIMIT 1
INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`) VALUES ('root23', '$2a$12$muUEOoxidl5GVBy47tGB3uyVJ0YxfS93n7qwSYtOyWUXNKp0xUXx.', '2022-10-01 05:07:38.579035', '2022-10-01 05:07:38.579035')